[{"date":"2014-11-20T20:36:03Z","author":"fzs","fields":{"title":"The Delete button for repositories is placed rather unfortunately","body":"The Delete button for a repository is in a dangerous place, right next to the Save and Cancel buttons. I would like to suggest placing it somewhere where there is a smaller chance of hitting it by accident. Like on GitHub there is a separate section for that, making very clear to make sure the user really wants this.","type":"Enhancement","severity":"Unrated","priority":"Normal","mergeTo":"develop","watchers":"+fzs","status":"New"}},{"date":"2014-11-20T20:41:17Z","author":"james","comment":{"text":"I consider this a non-issue as there is a confirmation prompt.","id":"a31e39d159e26ee42269e81201ee2381b0086df0"},"fields":{"watchers":"+james"}},{"date":"2014-11-20T20:46:17Z","author":"fzs","comment":{"text":"Fair enough. Would you still allow me to place it differently, when I get the time to so do, or would you rather keep it where it is?","id":"9ab92df0a8711d41e8d58c682ed4f5142d814d92"}},{"date":"2014-11-20T20:51:59Z","author":"james","comment":{"text":"Ok, we can put it on some sort of new tab. We\u0027ll have to dress it up to give it some mass - having a lone delete button would look peculiar.  And now that I look at it, I like the tabbed-part but I never restructured the repo header.  Yuck, looks terrrible. Well another thing to put on the list, I suppose.  ;)","id":"12c9af00cc12d1f13e9df9002d0e6febd69ebad4"}},{"date":"2014-11-20T20:59:51Z","author":"fzs","comment":{"text":"As mentioned above, I did not want to load this off on you and I don\u0027t consider this urgent in any way.\nI\u0027m willing to try my hand at this myself. Which won\u0027t be any time soon, either. I wouldn\u0027t necessary see this as a separate tab, but at least as a separated section on an existing tab.","id":"d0e2a8cc2d164ba67d9c28089323036be123e8ea"}},{"date":"2014-11-20T21:01:49Z","author":"james","comment":{"text":"That sounds good too.","id":"de8caeb1ea01c6cfb9ad7ef57d5ce4a47ca0e9b1"}},{"date":"2015-03-07T14:33:56Z","author":"james","fields":{"status":"Open","topic":"issue-561","responsible":"james","milestone":"v1.7.0","severity":"Negligible"}}]