[{"date":"2014-11-20T16:46:40Z","author":"fzs","fields":{"title":"Invalid email addresses result in an inifinite loop of retries.","body":"When Gitblit send an email, e.g. for a ticket, and some email addresses are rejected, e.g. because they do not exist or the SMTP server denies relaying them, the email delivery for all recipients fails and will retried ad inifinitum, every two minutes, as long as the SMPT server keeps rejecting the same addresses.\n\nFirst, the logging could be improved for failed emails, listing the invalid addresses. I don\u0027t know if there are privacy concerns around this.\n\nSecond, we need to find a strategy to deal with invalid addresses on failed delivery. Should they be retried at all, if yes, how often and in what intervals? It\u0027s not very nice to keep hammering a SMTP server every two minutes. Some throttling would be nicer.\n\nI would suggest to re-queue the message with only the valid unset recipients. Then either discard the invalid recipient, assuming they will never go through, or re-queue a copy with the invalid recipients while at the same time keeping a counter of retries for this message.","type":"Bug","severity":"Minor","priority":"Normal","mergeTo":"develop","watchers":"+fzs","status":"New"}},{"date":"2014-11-20T19:10:14Z","author":"james","comment":{"text":"I don\u0027t have a ton of experience with different SMTP servers, but the ones I\u0027ve used before maintain their own outgoing queue which disconnects Gitblit from the SMTP\u0027s actual sending process and makes recipient validation asynchronous.  In those scenarios there are bounce-back emails rather than thrown exceptions or hand-off failures.  Once Gitblit successfully hands-off the message to the SMTP server, it won\u0027t be re-tried form Gitblit.\n\nWhat SMTP server are you using?","id":"b5f443d19cbb9b9e1a7bdc1c9860ac812344ff01"},"fields":{"watchers":"+james"}},{"date":"2014-11-20T20:33:27Z","author":"fzs","comment":{"text":"I am using a Microsoft Exchange server. And it is not about the SMPT server\u0027s outgoing queue, but about email addresses that the SMTP server rejects in the original request from Gitblit to the server in the RCTP TO command. Current example, our Exchange rejected some email which would be relayed to an different part of the organisation. Other scenario, the SMTP server is not a relay but owns the domain itself an the email addresses are unknown to it.\nSo it is about the messages that are *not* handed off successfully to the SMTP server but are rejected by the SMPT server. Which throws an exception different from the one being thrown when Gitblit couldn\u0027t connect to the server. The latter would be worth a periodic retry, the former maybe not.\n\nI\u0027m willing to provide a patch, I just wanted to start the discussion about this first here. \n\nI any case I think the logging could need some improvement if there aren\u0027t any concerns with logging email addresses. It helped me diagnose why I got an exception in the log every two minutes,","id":"4f776d34de0e349fcf29bbf7133757ee7b841b1b"}}]